Revit 2024 API
ViewDetailLevel Enumeration
 Detail level of the view
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum ViewDetailLevel
Visual Basic
Public Enumeration ViewDetailLevel
Visual C++
public enum class ViewDetailLevel
Members
Member name | Description
Undefined |  View does not use Detail Level
Coarse |  Coarse
Medium |  Medium
Fine |  Fine
See Also
Autodesk.Revit.DB Namespace